package com.lld360.cnc.core;

/**
 * Author: dhc
 * Date: 2016-07-06 10:08
 */
public enum M {

    I10200,  // 成功

    E10001,  // 手机号码缺失或无效
    E10002,  // 密码缺失或无效
    E10003,  // 验证码缺失或无效
    E10004,  // 请先获取验证码再注册
    E10005,  // 验证码已过期，请重新获取
    E10006,  // 验证码错误
    E10007,  // 该手机号码已被注册
    E10008,  // 短信发送失败
    E10009,  // 验证码不存在或已过期，请重新获取
    E10010,  // 验证码不正确


    E10011,  // 账号不存在
    E10012,  // 账号或密码错误
    E10013,  // 账号不可用
    E10014,  // 错误次数过多
    E10015,  // 账号已锁定
    E10016,  // 该手机号已被绑定
    E10017,  // 绑定手机号失败
    E10018,  // 该用户已被删除（state=-1）

    E10101,  //无法写入文件
    E10102,  //无法创建文件夹
    E10103,  //移动文件夹失败
    E10104,  //移动文件失败
    E10105,  //文件不存在
    E10106,  //已经存在相同的文件
    E10107,  //不支持的文件类型

    E20001,  // 积分不足
    E20002,  // 充值金额必须为大于10的整数

    E90001,  // 非法请求
    E90002,  // 自定义错误消息
    E90003,  // 文件保存失败

    S90400,  // 参数不正确
    S90401,  // 需要登录
    S90403,  // 无权限执行
    S90404,  // 请求资源不存在
    S90405,  // 请求方式不正确
    S90500;  // 系统错误

    public int getCode() {
        return Integer.parseInt(getCodeStr());
    }

    public String getCodeStr() {
        return this.name().substring(1);
    }
}
